src/Catalogs/ПравилаМиграцииИДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ПравилаМиграцииИДоступа</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВариантНастройки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыМиграцииОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МиграцияТолькоПроведенных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПодразделенияИнформационныхБаз</Name>
					<Comment>Используется только для индивидуального способа настройки</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнформационнаяБаза</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗапретитьПросмотр</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗапретитьИзменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/СпособыМиграцииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СпособыМиграцииОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПолнаяМиграция</Name>
					<Comment>Миграция объектов производится во все доступные узлы распределенной базы данных без ограничений</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МиграцияЗапрещена</Name>
					<Comment>Миграция объектов полностью запрещена по всем доступным узлам распределенной информационной базы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МиграцияПоПодразделениямУзлов</Name>
					<Comment>Миграция объектов производится в узлы распределенной информационной базы, содержащие в себе подразделение документа</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальнаяНастройкаПоПодразделениямИУзлам</Name>
					<Comment>Миграция объектов производится по узлам распределенной информационной базы в соответствии  с настройками в табличной части Подразделения справочника Правила миграции и доступа</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ПравилаМиграцииИДоступа/Ext/ManagerModule.bsl
// Модуль менеджера справочника "Правила миграции и доступа"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура заполнения предопределенных элементов справочника
//
Процедура ВыполнитьНачальноеЗаполнение() Экспорт
	
	// Проверим заполнение предопределенных элементов.
	НеобходимоСохранить = Ложь;
	ПравилоМиграцииОбъект = Справочники.ПравилаМиграцииИДоступа.ПолнаяМиграция.ПолучитьОбъект();
	Если ПравилоМиграцииОбъект.ВариантНастройки <> Перечисления.СпособыМиграцииОбъектов.ПолнаяМиграция Тогда
		ПравилоМиграцииОбъект.ВариантНастройки = Перечисления.СпособыМиграцииОбъектов.ПолнаяМиграция;
		НеобходимоСохранить = Истина;
	КонецЕсли;
	Если СтрНайти(ВРЕГ(СокрЛП(ПравилоМиграцииОбъект.Наименование)),"ПОЛНАЯ МИГРАЦИЯ") = 0 Тогда
		ПравилоМиграцииОбъект.Наименование = НСтр("ru = 'Полная миграция (по всем узлам)'");
		НеобходимоСохранить = Истина;
	КонецЕсли;
	Если НеобходимоСохранить Тогда
		Попытка
			ПравилоМиграцииОбъект.УстановитьНовыйКод();
			ПравилоМиграцииОбъект.Записать();
			ВывестиСообщение(НСтр("ru='Справочник ""Правила миграции и доступа"". Обновлен элемент ""%1""'"),,,,,ПравилоМиграцииОбъект.Наименование );
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при записи элемента справочника ""Правила миграции и доступа""'",
				ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),УровеньЖурналаРегистрации.Ошибка,,,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли;
	
	НеобходимоСохранить = Ложь;
	ПравилоМиграцииОбъект = Справочники.ПравилаМиграцииИДоступа.МиграцияПоПодразделениямУзлов.ПолучитьОбъект();
	Если ПравилоМиграцииОбъект.ВариантНастройки <> Перечисления.СпособыМиграцииОбъектов.МиграцияПоПодразделениямУзлов Тогда
		ПравилоМиграцииОбъект.ВариантНастройки = Перечисления.СпособыМиграцииОбъектов.МиграцияПоПодразделениямУзлов;
		НеобходимоСохранить = Истина;
	КонецЕсли;
	Если СтрНайти(ВРЕГ(СокрЛП(ПравилоМиграцииОбъект.Наименование)),"УЗЛЫ С ПОДРАЗДЕЛЕНИЕМ ДОКУМЕНТА") = 0 Тогда
		ПравилоМиграцииОбъект.Наименование = НСтр("ru = 'В узлы с подразделением документа'");
		НеобходимоСохранить = Истина;
	КонецЕсли;
	Если НеобходимоСохранить Тогда
		Попытка
			ПравилоМиграцииОбъект.УстановитьНовыйКод();
			ПравилоМиграцииОбъект.Записать();
			ВывестиСообщение(НСтр("ru='Справочник ""Правила миграции и доступа"". Обновлен элемент ""%1""'"),,,,,ПравилоМиграцииОбъект.Наименование);
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при записи элемента справочника ""Правила миграции и доступа""'",
				ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),УровеньЖурналаРегистрации.Ошибка,,,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьНачальноеЗаполнение()


////////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ ОБРАБОТКИ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Наименование");
	ОбязательныеРеквизиты.Добавить("Код");
	
	Если Объект.ВариантНастройки = Перечисления.СпособыМиграцииОбъектов.ИндивидуальнаяНастройкаПоПодразделениямИУзлам Тогда
		ОбязательныеРеквизиты.Добавить("ВариантНастройки");
	КонецЕсли;
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Обязательные поля таблицы товаров
	УникальныеРеквизиты = Новый Структура();
	
	Если НЕ Объект.ВариантНастройки = Перечисления.СпособыМиграцииОбъектов.ИндивидуальнаяНастройкаПоПодразделениямИУзлам Тогда
		УникальныеРеквизиты.Вставить("ВариантНастройки");
	КонецЕсли;
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьУникальныеРеквизиты()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

// Обработчик события возникающего при изменении данных реквизита "Вариант настройки".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ВариантНастройкиПриИзменении(ЭтотОбъект, ПараметрыДействия=Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Объект.ВариантНастройки) Тогда
		ЭтотОбъект.Элементы.НадписьПояснениеНастройки.Заголовок = Метаданные.Перечисления.СпособыМиграцииОбъектов.ЗначенияПеречисления[Перечисления.СпособыМиграцииОбъектов.Индекс(ЭтотОбъект.Объект.ВариантНастройки)].Комментарий;
	Иначе
		ЭтотОбъект.Элементы.НадписьПояснениеНастройки.Заголовок = "";
	КонецЕсли;
	
КонецПроцедуры // ВариантНастройкиПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

КонецПроцедуры // Печать()

#КонецЕсли
